In [91]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
from sklearn.preprocessing import LabelEncoder

In [92]:
data_folder = '../../data/churn/'

In [93]:
data = pd.read_csv(os.path.join(data_folder, 'train.csv'), delimiter=',')

In [94]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,01/10/2017,0,5200,NaN,810,21OCT17:00:00:00,5023.0,POS,0,0.0
1,01/10/2017,0,6011,NaN,810,12OCT17:12:24:07,20000.0,DEPOSIT,0,0.0
2,01/12/2017,0,5921,NaN,810,05DEC17:00:00:00,767.0,POS,0,0.0
3,01/10/2017,0,5411,NaN,810,21OCT17:00:00:00,2031.0,POS,0,0.0
4,01/10/2017,0,6012,NaN,810,24OCT17:13:14:24,36562.0,C2C_OUT,0,0.0

In [95]:
data['PERIOD'].unique()

array(['01/10/2017', '01/12/2017', '01/07/2017', '01/09/2017',
       '01/08/2017', '01/06/2017', '01/04/2017', '01/05/2017',
       '01/03/2017', '01/11/2016', '01/12/2016', '01/01/2017',
       '01/02/2017', '01/11/2017', '01/01/2018', '01/02/2018',
       '01/03/2018', '01/04/2018', '01/10/2016'], dtype=object)

In [96]:
data['PERIOD'] = data['PERIOD'].apply(lambda x: pd.to_datetime(x, format='%d/%m/%Y'))

In [97]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2017-10-01,0,5200,NaN,810,21OCT17:00:00:00,5023.0,POS,0,0.0
1,2017-10-01,0,6011,NaN,810,12OCT17:12:24:07,20000.0,DEPOSIT,0,0.0
2,2017-12-01,0,5921,NaN,810,05DEC17:00:00:00,767.0,POS,0,0.0
3,2017-10-01,0,5411,NaN,810,21OCT17:00:00:00,2031.0,POS,0,0.0
4,2017-10-01,0,6012,NaN,810,24OCT17:13:14:24,36562.0,C2C_OUT,0,0.0

In [98]:
data.sort_values(by='PERIOD', axis=0, inplace=True)

In [99]:
data.reset_index(inplace=True, drop=True)

In [100]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,7622,5533,type1,810,26OCT16:00:00:00,210.00,POS,0,0.0
1,2016-10-01,9039,8099,type1,810,28OCT16:00:00:00,1350.00,POS,0,0.0
2,2016-10-01,6588,5411,type1,810,23OCT16:00:00:00,514.96,POS,1,691.0
3,2016-10-01,7929,8999,type1,810,21OCT16:00:00:00,13254.78,POS,0,0.0
4,2016-10-01,5195,4111,type1,810,21OCT16:00:00:00,840.00,POS,0,0.0

In [101]:
data['TRDATETIME'].unique()

array(['26OCT16:00:00:00', '28OCT16:00:00:00', '23OCT16:00:00:00', ...,
       '02APR18:08:58:13', '02APR18:19:07:05', '02APR18:17:01:46'],
      dtype=object)

In [102]:
month_lookup = {'JAN': '01', 'FEB': '02', 'MAR': '03', 'APR': '04', 'MAY': '05', 'JUN': '06', 'JUL': '07', 'AUG': '08', 
                'SEP': '09', 'OCT': '10', 'NOV': '11', 'DEC': '12'}

In [103]:
data['TRDATETIME'] = data['TRDATETIME'].apply(lambda x: x[:2] + '.' + month_lookup[x[2:5]] + '.' + x[5:7] + ' ' + x[8:])

In [104]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,7622,5533,type1,810,26.10.16 00:00:00,210.00,POS,0,0.0
1,2016-10-01,9039,8099,type1,810,28.10.16 00:00:00,1350.00,POS,0,0.0
2,2016-10-01,6588,5411,type1,810,23.10.16 00:00:00,514.96,POS,1,691.0
3,2016-10-01,7929,8999,type1,810,21.10.16 00:00:00,13254.78,POS,0,0.0
4,2016-10-01,5195,4111,type1,810,21.10.16 00:00:00,840.00,POS,0,0.0

In [105]:
data['TRDATETIME'] = data['TRDATETIME'].apply(lambda x: pd.to_datetime(x, format='%d.%m.%y %H:%M:%S'))

In [106]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,7622,5533,type1,810,2016-10-26,210.00,POS,0,0.0
1,2016-10-01,9039,8099,type1,810,2016-10-28,1350.00,POS,0,0.0
2,2016-10-01,6588,5411,type1,810,2016-10-23,514.96,POS,1,691.0
3,2016-10-01,7929,8999,type1,810,2016-10-21,13254.78,POS,0,0.0
4,2016-10-01,5195,4111,type1,810,2016-10-21,840.00,POS,0,0.0

In [107]:
data.sort_values(by='TRDATETIME', axis=0, inplace=True)

In [108]:
data.reset_index(inplace=True, drop=True)

In [109]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,485,4121,type2,810,2016-10-07 00:00:00,242.0,POS,1,85.00
1,2016-10-01,1290,5411,type2,810,2016-10-07 00:00:00,2465.0,POS,1,321242.09
2,2016-10-01,485,6011,type2,810,2016-10-07 00:00:00,3600.0,WD_ATM_PARTNER,1,85.00
3,2016-10-01,1290,6011,type2,810,2016-10-07 18:57:17,10000.0,WD_ATM_ROS,1,321242.09
4,2016-10-01,5948,5511,type1,810,2016-10-08 00:00:00,780.0,POS,1,4222.62

In [110]:
enc = LabelEncoder()
data['MCC'] = enc.fit_transform(data['MCC'])

In [111]:
data.head()

,PERIOD,cl_id,MCC,channel_type,currency,TRDATETIME,amount,trx_category,target_flag,target_sum
0,2016-10-01,485,103,type2,810,2016-10-07 00:00:00,242.0,POS,1,85.00
1,2016-10-01,1290,158,type2,810,2016-10-07 00:00:00,2465.0,POS,1,321242.09
2,2016-10-01,485,244,type2,810,2016-10-07 00:00:00,3600.0,WD_ATM_PARTNER,1,85.00
3,2016-10-01,1290,244,type2,810,2016-10-07 18:57:17,10000.0,WD_ATM_ROS,1,321242.09
4,2016-10-01,5948,164,type1,810,2016-10-08 00:00:00,780.0,POS,1,4222.62

In [112]:
df = data.groupby('cl_id')['MCC'].agg(lambda x: list(x))

In [113]:
df = pd.DataFrame(df)
df.reset_index(inplace=True)

In [114]:
df.head()

   cl_id                                                MCC
0      0                          [244, 147, 158, 245, 204]
1      1  [198, 158, 198, 198, 158, 244, 158, 198, 198, ...
2      5  [178, 197, 178, 182, 113, 158, 301, 158, 182, ...
3      9  [242, 244, 245, 242, 244, 245, 242, 242, 242, ...
4     10  [158, 168, 158, 163, 158, 244, 244, 242, 242, ...

In [115]:
target_df = data[['cl_id', 'target_flag']].drop_duplicates()
target_df.reset_index(inplace=True, drop=True)

In [116]:
df = df.merge(target_df, how='inner',on='cl_id')

In [117]:
df.head()

   cl_id                                                MCC  target_flag
0      0                          [244, 147, 158, 245, 204]            0
1      1  [198, 158, 198, 198, 158, 244, 158, 198, 198, ...            0
2      5  [178, 197, 178, 182, 113, 158, 301, 158, 182, ...            1
3      9  [242, 244, 245, 242, 244, 245, 242, 242, 242, ...            0
4     10  [158, 168, 158, 163, 158, 244, 244, 242, 242, ...            0

In [118]:
df.rename({'cl_id': 'id', 'MCC': 'mcc', 'target_flag': 'target'}, axis=1, inplace=True)

In [119]:
df.head()

   id                                                mcc  target
0   0                          [244, 147, 158, 245, 204]       0
1   1  [198, 158, 198, 198, 158, 244, 158, 198, 198, ...       0
2   5  [178, 197, 178, 182, 113, 158, 301, 158, 182, ...       1
3   9  [242, 244, 245, 242, 244, 245, 242, 242, 242, ...       0
4  10  [158, 168, 158, 163, 158, 244, 244, 242, 242, ...       0

In [120]:
df.shape

(5000, 3)

In [121]:
all_l = []
for i in range(len(df)):
    all_l.append(len(df.loc[i, 'mcc']))

In [122]:
df = df.loc[df['mcc'].apply(lambda x: len(x)) >= 10]

In [123]:
df.shape

(4617, 3)

In [124]:
df['mcc'] = df['mcc'].apply(lambda x: x[-200:])

In [125]:
df['target'].value_counts()

1    2672
0    1945
Name: target, dtype: int64

In [126]:
zero_id = df.loc[df['target']==0]['id']
one_id = df.loc[df['target']==1]['id']

reduced_one_id = np.random.choice(one_id, size=len(df.loc[df['target']==0]), replace=False)
df = df.loc[df['id'].isin(list(zero_id)+list(reduced_one_id))]
df.reset_index(inplace=True, drop=True)
df['target'].sum() / len(df) * 100

50.0

In [127]:
df = df.sample(frac=1).reset_index(drop=True)

In [128]:
df.shape

(3890, 3)

### Train-valid-test split

In [129]:
all_id = df['id'].values

In [130]:
train_id = all_id[:int(0.7 * len(all_id))]
valid_id = all_id[int(0.7 * len(all_id)):int(0.8 * len(all_id))]
test_id = all_id[int(0.8 * len(all_id)):]

In [131]:
train_df = df.loc[df['id'].isin(train_id)]
valid_df = df.loc[df['id'].isin(valid_id)]
test_df = df.loc[df['id'].isin(test_id)]

In [135]:
train_df['target'].sum() / len(train_df), valid_df['target'].sum() / len(valid_df), \
test_df['target'].sum() / len(test_df)

(0.5031215571061329, 0.4987146529562982, 0.4897172236503856)

In [132]:
len(train_id) / len(df), len(valid_id) / len(df), len(test_id) / len(df)

(0.7, 0.1, 0.2)

In [133]:
train_df.reset_index(inplace=True, drop=True)
valid_df.reset_index(inplace=True, drop=True)
test_df.reset_index(inplace=True, drop=True)

In [134]:
train_df.to_csv('../../data/processed_churn/train.csv')
valid_df.to_csv('../../data/processed_churn/valid.csv')
test_df.to_csv('../../data/processed_churn/test.csv')